Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMS70_DFP/4.6.82/Microchip.SAMS70_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
         schemaVersion="1.3"
         xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd"
         xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Microchip</vendor>
   <url>https://packs.download.microchip.com/</url>
   <name>SAMS70_DFP</name>
   <description>Microchip SAMS70 Series Device Support</description>
   <releases>
      <release version="4.6.82" date="2021-06-30">Deprecated revision A devices. Fixed MPLABX debug scripts. Updated startup code. Updated header files. Updated XC32 content.</release>
      <release version="4.5.74" date="2021-01-27">Added security bit programming for MPLAB X. Added instance headers. Fix DMA trigger information for DACn.</release>
      <release version="4.4.69" date="2020-09-24">Added read device ID. Fix reading/writing configbits.</release>
      <release version="4.3.58" date="2020-04-29">Updated MPLAB X debug scripts. Added CCW and CCF interrupts to A devices. Setup prerequisite for MPLAB v5.40 or newer</release>
      <release version="4.2.54" date="2020-02-12">Updated XC32 content. Updated MPLAB X debug scripts.</release>
      <release version="4.1.43" date="2019-10-07">Improvements to the flash programming algorithm. Rename SVCall_Handler to SVC_Handler. Update modes for USART.</release>
      <release version="4.0.34" date="2019-06-26">Improvements to the flash programming algorithm: Improve programming speed. Resolve a possible flash programming issue.</release>
      <release version="4.0.21" date="2019-05-04">Removed legacy headers.</release>
      <release version="3.0.5" date="2019-02-08">Corrections to XML and header-files. Core modules descriptions in ATDF and SVD changed for rev. B devices. Core IRQ and interrupt handler names changed to alligne with CMSIS names. Old names mapped as aliases to new names. Several errors in SVD files corrected. Missing TC1 and TC2 to instance definitions added to header files.  TC, USART and USBHS module changed (for revB devices) to reflect the modes according to the datasheet. Added ARMCC support files. Added Keil support files. Succeeds Atmel.SAMS70_DFP 2.3.88.</release>
   </releases>
   <keywords>
      <keyword>Microchip</keyword>
      <keyword>Device Family Package Microchip</keyword>
      <keyword>Device Support</keyword>
      <keyword>SAMS70</keyword>
   </keywords>
   <devices>
      <family Dfamily="SAMS70" Dvendor="Microchip:3">
         <debugvars configfile="sams70a/keil/debug/SAMx7.dbgconf" version="1.0.0">
           // Debug Access Variables
           __var TracePCK3 = 0x00000000;                                               // Trace Clock Source Selection and Prescaler
         </debugvars>
         <sequences>
           <!-- Override for Pre-Defined TraceStart Sequence -->
            <sequence name="TraceStart">
               <block>
               __var traceSWO    = (__traceout &amp; 0x1) != 0;                        // SWO Trace Selected?
               __var traceTPIU   = (__traceout &amp; 0x2) != 0;                        // TPIU Trace Selected?
             </block>
               <control if="traceSWO">
                  <block>
                 Sequence("EnableTraceSWO");                                           // Call SWO Trace Setup
               </block>
               </control>
               <control if="traceTPIU">
                  <block>
                 Sequence("EnableTraceTPIU");                                          // Call TPIU Trace Setup
               </block>
               </control>
            </sequence>
            <!-- User-Defined EnableTraceSWO Sequence -->
            <sequence name="EnableTraceSWO">
               <block>
               Write32(0x400E06E4, 0x504D4300);                                        // Disable PMC write protection
               Write32(0x400E064C, TracePCK3);                                         // Select clock source and prescaler for PCK3
               Write32(0x400E0600, (1 &lt;&lt; 11));                                   // Enable PCK3
             </block>
            </sequence>
            <!-- User-Defined EnableTraceTPIU Sequence -->
            <sequence name="EnableTraceTPIU">
               <block>
               __var width = (__traceout &amp; 0x003F0000) &gt;&gt; 16;                // TPIU Port Width
               __var val   = 0;
             </block>
               <control if="width == 1">
                  <block>
                 // 1-Bit TPIU Trace Setup
                 val = 0x00000010;                                                     // TRACED[0]
               </block>
               </control>
               <control if="width == 2">
                  <block>
                 // 2-Bit TPIU Trace Setup
                 val = 0x00000030;                                                     // TRACED[0..1]
               </block>
               </control>
               <control if="width == 4">
                  <block>
                 // 4-Bit TPIU Trace Setup
                 val = 0x000000F0;                                                     // TRACED[0..3]
               </block>
               </control>
               <block>
               // Write Trace Configuration to Target
               Write32(0x400E06E4, 0x504D4300);                                        // Disable PMC write protection
               Write32(0x400E064C, TracePCK3);                                         // Select clock source and prescaler for PCK3
               Write32(0x400E0600, (1 &lt;&lt; 11));                                   // Enable PCK3
               Write32(0x400E0610, (1 &lt;&lt; 16));                                   // Enable PIOD clock

               Write32(0x400E14E4, 0x50494F00);                                        // Disable PIOD write protection
               Write32(0x400E1404, (val | 0x00000100));                                // Disable PIOD PD[4..8]
               Write32(0x400E1470, ((Read32(0x400E1470) &amp; ~val) | 0x00000100));    // Set Peripheral Select registers
               Write32(0x400E1474, ((Read32(0x400E1474) |      val) | 0x00000100));    // TRACED[0..3] to alternate peripheral C and TRACECLK to alternate peripheral D
             </block>
            </sequence>
         </sequences>
         <environment name="microchip">
            <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                            schemaVersion="1.0">
               <mchp:prerequisite component="MPLAB X IDE" version="[5.50-"/>
               <mchp:prerequisite component="MPLAB X IPE" version="[5.10-"/>
            </mchp:extension>
         </environment>
         <device Dname="ATSAMS70J19">
            <deprecated>2021-06-28</deprecated>
         </device>
