Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMS70_DFP/4.6.82/Microchip.SAMS70_DFP.pdsc
         <device Dname="ATSAMS70J20">
            <deprecated>2021-06-28</deprecated>
         </device>
         <device Dname="ATSAMS70J21">
            <deprecated>2021-06-28</deprecated>
         </device>
         <device Dname="ATSAMS70N19">
            <deprecated>2021-06-28</deprecated>
         </device>
         <device Dname="ATSAMS70N20">
            <deprecated>2021-06-28</deprecated>
         </device>
         <device Dname="ATSAMS70N21">
            <deprecated>2021-06-28</deprecated>
         </device>
         <device Dname="ATSAMS70Q19">
            <deprecated>2021-06-28</deprecated>
         </device>
         <device Dname="ATSAMS70Q20">
            <deprecated>2021-06-28</deprecated>
         </device>
         <device Dname="ATSAMS70Q21">
            <deprecated>2021-06-28</deprecated>
         </device>
         <device Dname="ATSAMS70J19B">
            <processor Dcore="Cortex-M7"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="DP_FPU"/>
            <compile header="sams70b/include/sam.h" define="__SAMS70J19B__"/>
            <debug svd="sams70b/svd/ATSAMS70J19B.svd"/>
            <memory id="IROM1"
                    start="0x00400000"
                    size="0x00080000"
                    default="1"
                    startup="1"/>
            <memory id="IROM2" start="0x00800000" size="0x00004000"/>
            <memory id="IRAM1" start="0x20400000" size="0x00040000" default="1"/>
            <algorithm name="sams70b/keil/flash/ATSAMS7x_512.FLM"
                       start="0x00400000"
                       size="0x00080000"
                       default="1"/>
            <algorithm name="sams70b/keil/flash/ATSAMS7x_GPNVM.FLM"
                       start="0x1FFFFFF0"
                       size="0x00000010"
                       default="0"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="sams70b/atdf/ATSAMS70J19B.atdf"/>
                  <at:variant ordercode="ATSAMS70J19B-MN"
                              vccmin="1.62"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="+105"/>
                  <at:variant ordercode="ATSAMS70J19B-AN"
                              vccmin="1.62"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="+105"/>
                  <at:memory name="PERIPHERALS"
                             start="0x40000000"
                             size="0x20000000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="SYSTEM"
                             start="0xE0000000"
                             size="0x10000000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="QSPIMEM"
                             start="0x80000000"
                             size="0x20000000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="AXIMX"
                             start="0xA0000000"
                             size="0x00100000"
                             type="other"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="ITCM"
                             start="0x00000000"
                             size="0x00200000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IFLASH"
                             start="0x00400000"
                             size="0x00080000"
                             type="flash"
                             pagesize="512"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IROM"
                             start="0x00800000"
                             size="0x00004000"
                             type="rom"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="DTCM"
                             start="0x20000000"
                             size="0x00020000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IRAM"
                             start="0x20400000"
                             size="0x00040000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
                  <at:prerequisite component="MPLAB X IDE" version="[5.50-"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="sams70b/edc/ATSAMS70J19B.PIC"/>
                  <mchp:xc32 name="sams70b/xc32"/>
                  <mchp:hwtool type="mplab.nmmrs">
                     <mchp:file name="sams70b/hwtools/mplab/avr.8bit.NMMRs.xml"/>
                     <mchp:file name="sams70b/hwtools/mplab/8bit.NMMRs.xml"/>
                     <mchp:file name="sams70b/hwtools/mplab/32bit.NMMRs.xml"/>
                     <mchp:file name="sams70b/hwtools/mplab/arm.32bit.NMMRs.xml"/>
                     <mchp:file name="sams70b/hwtools/mplab/16bit.NMMRs.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.devicesupport">
                     <mchp:file name="sams70b/hwtools/mplab/mplab.deviceSupport"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="sams70b/hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="sams70b/hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAMS70J19B"
                  title="Device page for ATSAMS70J19B"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAMS70J19B"
                  title="Datasheet"/>
         </device>
         <device Dname="ATSAMS70J20B">
            <processor Dcore="Cortex-M7"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="DP_FPU"/>
            <compile header="sams70b/include/sam.h" define="__SAMS70J20B__"/>
            <debug svd="sams70b/svd/ATSAMS70J20B.svd"/>
            <memory id="IROM1"
                    start="0x00400000"
                    size="0x00100000"
                    default="1"
                    startup="1"/>
            <memory id="IROM2" start="0x00800000" size="0x00004000"/>
            <memory id="IRAM1" start="0x20400000" size="0x00060000" default="1"/>
            <algorithm name="sams70b/keil/flash/ATSAMS7x_1024.FLM"
                       start="0x00400000"
                       size="0x00100000"
                       default="1"/>
            <algorithm name="sams70b/keil/flash/ATSAMS7x_GPNVM.FLM"
                       start="0x1FFFFFF0"
                       size="0x00000010"
                       default="0"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="sams70b/atdf/ATSAMS70J20B.atdf"/>
                  <at:variant ordercode="ATSAMS70J20B-MN"
                              vccmin="1.62"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="+105"/>
                  <at:variant ordercode="ATSAMS70J20B-AN"
                              vccmin="1.62"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="+105"/>
                  <at:memory name="PERIPHERALS"
                             start="0x40000000"
                             size="0x20000000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="SYSTEM"
                             start="0xE0000000"
                             size="0x10000000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="QSPIMEM"
                             start="0x80000000"
                             size="0x20000000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="AXIMX"
                             start="0xA0000000"
                             size="0x00100000"
                             type="other"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="ITCM"
                             start="0x00000000"
                             size="0x00200000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IFLASH"
                             start="0x00400000"
                             size="0x00100000"
                             type="flash"
                             pagesize="512"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IROM"
                             start="0x00800000"
                             size="0x00004000"
                             type="rom"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="DTCM"
                             start="0x20000000"
                             size="0x00020000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IRAM"
                             start="0x20400000"
                             size="0x00060000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
                  <at:prerequisite component="MPLAB X IDE" version="[5.50-"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="sams70b/edc/ATSAMS70J20B.PIC"/>
                  <mchp:xc32 name="sams70b/xc32"/>
                  <mchp:hwtool type="mplab.nmmrs">
                     <mchp:file name="sams70b/hwtools/mplab/avr.8bit.NMMRs.xml"/>
                     <mchp:file name="sams70b/hwtools/mplab/8bit.NMMRs.xml"/>
                     <mchp:file name="sams70b/hwtools/mplab/32bit.NMMRs.xml"/>
                     <mchp:file name="sams70b/hwtools/mplab/arm.32bit.NMMRs.xml"/>
                     <mchp:file name="sams70b/hwtools/mplab/16bit.NMMRs.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.devicesupport">
                     <mchp:file name="sams70b/hwtools/mplab/mplab.deviceSupport"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="sams70b/hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="sams70b/hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAMS70J20B"
                  title="Device page for ATSAMS70J20B"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAMS70J20B"
                  title="Datasheet"/>
         </device>
