Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMS70_DFP/4.6.82/Microchip.SAMS70_DFP.pdsc
      <condition id="ATSAMS70J21B">
         <require Dvendor="Microchip:3" Dname="ATSAMS70J21B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70N19B">
         <require Dvendor="Microchip:3" Dname="ATSAMS70N19B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70N20B">
         <require Dvendor="Microchip:3" Dname="ATSAMS70N20B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70N21B">
         <require Dvendor="Microchip:3" Dname="ATSAMS70N21B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70Q19B">
         <require Dvendor="Microchip:3" Dname="ATSAMS70Q19B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70Q20B">
         <require Dvendor="Microchip:3" Dname="ATSAMS70Q20B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70Q21B">
         <require Dvendor="Microchip:3" Dname="ATSAMS70Q21B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="4.6.0"
                 condition="ATSAMS70J19B">
         <description>Headers and startup code for Microchip ATSAMS70J19B</description>
         <files>
            <file condition="C" category="include" name="sams70b/include/"/>
            <file condition="C" category="header" name="sams70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/gcc/startup_sams70j19b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/system_sams70j19b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sams70b/gcc/gcc/sams70j19b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sams70b/gcc/gcc/sams70j19b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/armcc/startup_sams70j19b.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/system_sams70j19b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/iar/startup_sams70j19b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/system_sams70j19b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sams70b/iar/config/linker/Microchip/atsams70j19b/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sams70b/iar/config/linker/Microchip/atsams70j19b/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="4.6.0"
                 condition="ATSAMS70J20B">
         <description>Headers and startup code for Microchip ATSAMS70J20B</description>
         <files>
            <file condition="C" category="include" name="sams70b/include/"/>
            <file condition="C" category="header" name="sams70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/gcc/startup_sams70j20b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/system_sams70j20b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sams70b/gcc/gcc/sams70j20b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sams70b/gcc/gcc/sams70j20b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/armcc/startup_sams70j20b.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/system_sams70j20b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/iar/startup_sams70j20b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/system_sams70j20b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sams70b/iar/config/linker/Microchip/atsams70j20b/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sams70b/iar/config/linker/Microchip/atsams70j20b/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="4.6.0"
                 condition="ATSAMS70J21B">
         <description>Headers and startup code for Microchip ATSAMS70J21B</description>
         <files>
            <file condition="C" category="include" name="sams70b/include/"/>
            <file condition="C" category="header" name="sams70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/gcc/startup_sams70j21b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/system_sams70j21b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sams70b/gcc/gcc/sams70j21b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sams70b/gcc/gcc/sams70j21b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/armcc/startup_sams70j21b.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/system_sams70j21b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/iar/startup_sams70j21b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/system_sams70j21b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sams70b/iar/config/linker/Microchip/atsams70j21b/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sams70b/iar/config/linker/Microchip/atsams70j21b/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="4.6.0"
                 condition="ATSAMS70N19B">
         <description>Headers and startup code for Microchip ATSAMS70N19B</description>
         <files>
            <file condition="C" category="include" name="sams70b/include/"/>
            <file condition="C" category="header" name="sams70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/gcc/startup_sams70n19b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/system_sams70n19b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sams70b/gcc/gcc/sams70n19b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sams70b/gcc/gcc/sams70n19b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/armcc/startup_sams70n19b.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/system_sams70n19b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/iar/startup_sams70n19b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/system_sams70n19b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sams70b/iar/config/linker/Microchip/atsams70n19b/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sams70b/iar/config/linker/Microchip/atsams70n19b/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="4.6.0"
                 condition="ATSAMS70N20B">
         <description>Headers and startup code for Microchip ATSAMS70N20B</description>
         <files>
            <file condition="C" category="include" name="sams70b/include/"/>
            <file condition="C" category="header" name="sams70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/gcc/startup_sams70n20b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/system_sams70n20b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sams70b/gcc/gcc/sams70n20b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sams70b/gcc/gcc/sams70n20b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/armcc/startup_sams70n20b.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/system_sams70n20b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/iar/startup_sams70n20b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/system_sams70n20b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sams70b/iar/config/linker/Microchip/atsams70n20b/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sams70b/iar/config/linker/Microchip/atsams70n20b/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="4.6.0"
                 condition="ATSAMS70N21B">
         <description>Headers and startup code for Microchip ATSAMS70N21B</description>
         <files>
            <file condition="C" category="include" name="sams70b/include/"/>
            <file condition="C" category="header" name="sams70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/gcc/startup_sams70n21b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/system_sams70n21b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sams70b/gcc/gcc/sams70n21b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sams70b/gcc/gcc/sams70n21b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/armcc/startup_sams70n21b.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/system_sams70n21b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/iar/startup_sams70n21b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/system_sams70n21b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sams70b/iar/config/linker/Microchip/atsams70n21b/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sams70b/iar/config/linker/Microchip/atsams70n21b/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="4.6.0"
                 condition="ATSAMS70Q19B">
         <description>Headers and startup code for Microchip ATSAMS70Q19B</description>
         <files>
            <file condition="C" category="include" name="sams70b/include/"/>
            <file condition="C" category="header" name="sams70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/gcc/startup_sams70q19b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/system_sams70q19b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sams70b/gcc/gcc/sams70q19b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sams70b/gcc/gcc/sams70q19b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/armcc/startup_sams70q19b.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/system_sams70q19b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/iar/startup_sams70q19b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/system_sams70q19b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sams70b/iar/config/linker/Microchip/atsams70q19b/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sams70b/iar/config/linker/Microchip/atsams70q19b/flash.icf"
                  attr="config"/>
         </files>
      </component>
