Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMS70_DFP/4.6.82/Microchip.SAMS70_DFP.pdsc
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="4.6.0"
                 condition="ATSAMS70Q20B">
         <description>Headers and startup code for Microchip ATSAMS70Q20B</description>
         <files>
            <file condition="C" category="include" name="sams70b/include/"/>
            <file condition="C" category="header" name="sams70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/gcc/startup_sams70q20b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/system_sams70q20b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sams70b/gcc/gcc/sams70q20b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sams70b/gcc/gcc/sams70q20b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/armcc/startup_sams70q20b.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/system_sams70q20b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/iar/startup_sams70q20b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/system_sams70q20b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sams70b/iar/config/linker/Microchip/atsams70q20b/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sams70b/iar/config/linker/Microchip/atsams70q20b/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="4.6.0"
                 condition="ATSAMS70Q21B">
         <description>Headers and startup code for Microchip ATSAMS70Q21B</description>
         <files>
            <file condition="C" category="include" name="sams70b/include/"/>
            <file condition="C" category="header" name="sams70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/gcc/startup_sams70q21b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/system_sams70q21b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sams70b/gcc/gcc/sams70q21b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sams70b/gcc/gcc/sams70q21b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/armcc/startup_sams70q21b.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70b/armcc/system_sams70q21b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/iar/startup_sams70q21b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/system_sams70q21b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sams70b/iar/config/linker/Microchip/atsams70q21b/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sams70b/iar/config/linker/Microchip/atsams70q21b/flash.icf"
                  attr="config"/>
         </files>
      </component>
   </components>
</package>
